'''Задача №2939. Дележ яблок - 2
N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. 
Сколько яблок останется в корзинке?
'''
n = int(input)
k = int(input)
print(k % n)